{
    "modelTopology": {
        "class_name": "Model",
        "config": {
            "name": "model2",
            "layers": [
                {
                    "name": "input1",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            653
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input1"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "input2",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            1
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input2"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "input3",
                    "class_name": "InputLayer",
                    "config": {
                        "batch_input_shape": [
                            null,
                            19
                        ],
                        "dtype": "float32",
                        "sparse": false,
                        "name": "input3"
                    },
                    "inbound_nodes": []
                },
                {
                    "name": "Recyclables",
                    "class_name": "Dense",
                    "config": {
                        "units": 1000,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "Recyclables",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "input1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "Idle",
                    "class_name": "Dense",
                    "config": {
                        "units": 1000,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "Idle",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "input2",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "Unwanted",
                    "class_name": "Dense",
                    "config": {
                        "units": 1000,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "Unwanted",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "input3",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "myConcatenate1",
                    "class_name": "Concatenate",
                    "config": {
                        "axis": 1,
                        "name": "myConcatenate1",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "Recyclables",
                                0,
                                0,
                                {}
                            ],
                            [
                                "Idle",
                                0,
                                0,
                                {}
                            ],
                            [
                                "Unwanted",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                },
                {
                    "name": "myConcatenate1Dense4",
                    "class_name": "Dense",
                    "config": {
                        "units": 1,
                        "activation": "linear",
                        "use_bias": true,
                        "kernel_initializer": {
                            "class_name": "VarianceScaling",
                            "config": {
                                "scale": 1,
                                "mode": "fan_avg",
                                "distribution": "normal",
                                "seed": null
                            }
                        },
                        "bias_initializer": {
                            "class_name": "Zeros",
                            "config": {}
                        },
                        "kernel_regularizer": null,
                        "bias_regularizer": null,
                        "activity_regularizer": null,
                        "kernel_constraint": null,
                        "bias_constraint": null,
                        "name": "myConcatenate1Dense4",
                        "trainable": true
                    },
                    "inbound_nodes": [
                        [
                            [
                                "myConcatenate1",
                                0,
                                0,
                                {}
                            ]
                        ]
                    ]
                }
            ],
            "input_layers": [
                [
                    "input1",
                    0,
                    0
                ],
                [
                    "input2",
                    0,
                    0
                ],
                [
                    "input3",
                    0,
                    0
                ]
            ],
            "output_layers": [
                [
                    "myConcatenate1Dense4",
                    0,
                    0
                ]
            ]
        },
        "keras_version": "tfjs-layers 0.8.1",
        "backend": "tensor_flow.js"
    },
    "weightsManifest": [
        {
            "paths": [
                "./myClassifierModel01.weights.bin"
            ],
            "weights": [
                {
                    "name": "Recyclables/kernel",
                    "shape": [
                        653,
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "Recyclables/bias",
                    "shape": [
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "Idle/kernel",
                    "shape": [
                        1,
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "Idle/bias",
                    "shape": [
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "Unwanted/kernel",
                    "shape": [
                        19,
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "Unwanted/bias",
                    "shape": [
                        1000
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "myConcatenate1Dense4/kernel",
                    "shape": [
                        3000,
                        1
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "myConcatenate1Dense4/bias",
                    "shape": [
                        1
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}